## 문제 16.
## n! 이라는 표기법은 n × (n − 1) × ... × 3 × 2 × 1을 뜻합니다.

## 예를 들자면 10! = 10 × 9 × ... × 3 × 2 × 1 = 3628800 이 되는데,
## 여기서 10!의 각 자리수를 더해 보면 3 + 6 + 2 + 8 + 8 + 0 + 0 = 27 입니다.

## 100! 의 자리수를 모두 더하면 얼마입니까?

tmp = 1
idx = 1
while idx < 100:
    tmp *= idx
    idx += 1

# print(idx)
# print(tmp)

# 100! = 933262154439441526816992388562667004907159682643816214685929638952175999932299156089414639761565182862536979208272237582511852109168640000000000000000000000

# 자리수 모두 더하기
tmp_lst = list(str(tmp))
tmp_lst = [int(i) for i in tmp_lst]
ans = sum(tmp_lst)
print("답 : {}".format(ans))     # 648


